WoW_Test/src/DataProcessors/WoW_ПодборПодземелья/WoW_ПодборПодземелья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>WoW_ПодборПодземелья</name>
</mdclass:DataProcessor>

WoW_Test/src/InformationRegisters/WoW_СезонныеПодземелья/WoW_СезонныеПодземелья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>WoW_СезонныеПодземелья</name>
  <attributes>
    <name>Танк</name>
    <type>
      <types>CatalogRef.WoW_Персонажи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сезон</name>
    <type>
      <types>CatalogRef.WoW_Сезоны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подземелье</name>
    <type>
      <types>CatalogRef.WoW_Подземелья</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WoW_Test/src/DataProcessors/WoW_ПодборПодземелья/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РежимПодбора = "Рандомное подземелье";
	Элементы.ДляТанка.Доступность = Ложь;
	ДляТанка = Неопределено;
КонецПроцедуры
///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
///////////////////////Обработчики Событий Формы \\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область СобытияФормы

#КонецОбласти


///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
///////////////////////Обработчики Событий Команд\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область КомандыФормы

&НаКлиенте
Процедура БроситьКубики(Команда)
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("Танк", ДляТанка);
	ПараметрыПолучения.Вставить("РежимПодбора", РежимПодбора);
	ПараметрыПолучения.Вставить("БанСписок", БанСписок.ВыгрузитьЗначения());
	ПараметрыПолучения = Новый ФиксированнаяСтруктура(ПараметрыПолучения);
	ПараметрыПолучения_мод = новый Структура();
	
	ПутьККартинкеПодземелия = БроситьКубикиНаСервере(ПараметрыПолучения, ПараметрыПолучения_мод);
	ПроигратьЗвук();
		
	Элементы.ИмяТанка.Заголовок = ?(ПараметрыПолучения_мод.Свойство("ИмяТанка"),ПараметрыПолучения_мод.ИмяТанка,"");
	Элементы.НазваниеПодземелья.Заголовок = ?(ПараметрыПолучения_мод.Свойство("НазваниеПодземелья"),ПараметрыПолучения_мод.НазваниеПодземелья,"");
	Элементы.ИмяСезона.Заголовок = ?(ПараметрыПолучения_мод.Свойство("ИмяСезона"),ПараметрыПолучения_мод.ИмяСезона,"");
	
	ФайлКартинки = новый Файл(ПутьККартинкеПодземелия);
	
	ТранзитныеПараметры = новый Структура;
	ТранзитныеПараметры.Вставить("ПутьКФайлу", ПутьККартинкеПодземелия);
	ОповещениеПроверкиФайла = новый ОписаниеОповещения("ВывестиКартинкуВПолеФормы_ПровереноСуществованиеФайла", ЭтаФорма, ТранзитныеПараметры);	
	ФайлКартинки.НачатьПроверкуСуществования(ОповещениеПроверкиФайла);	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
///////////////////////Обработчики Событий Элементов\\\\\\\\\\\\\\\\\\\\\\\
////////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область ЭлементыФормы

&НаКлиенте
Процедура РежимПодбораПриИзменении(Элемент)
	Если РежимПодбора = "Подземелье для танка" Тогда
		Элементы.ДляТанка.Доступность = Истина;		
	Иначе
		Элементы.ДляТанка.Доступность = Ложь;
		ДляТанка = Неопределено;	
	КонецЕсли	
	
КонецПроцедуры

#КонецОбласти

///////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////////////////Служебные методы\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
////////////////\\\\\\\\\\\\\\\///////////////\\\\\\\\\\\\\\///////////////

#Область Служебные

&НаСервереБезКонтекста
Функция БроситьКубикиНаСервере(Знач ФиксированныеПараметры, МодифицируемыеПараметры = Неопределено)
	Если ТипЗнч(МодифицируемыеПараметры) <> Тип("Структура") Тогда
		МодифицируемыеПараметры = Новый Структура();
	КонецЕсли;
	
	Танк = ФиксированныеПараметры.Танк;
	РежимПодбора = ФиксированныеПараметры.РежимПодбора;
	БанСписок = ФиксированныеПараметры.БанСписок;
	
	ТекущийСезон = Константы.WoW_ТекущийСезон.Получить();
	
	Если НЕ ЗначениеЗаполнено(ТекущийСезон) Тогда
		МодифицируемыеПараметры.Вставить("ИмяСезона", "Сезон не заполнен в настройках.");
		Возврат Неопределено;
	КонецЕсли;
			
	МодифицируемыеПараметры.Вставить("ИмяСезона",ТекущийСезон.Наименование);			
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сезон", ТекущийСезон);
	Запрос.УстановитьПараметр("БанСписок", БанСписок);
	
	Если РежимПодбора = "Рандомное подземелье" Тогда
		ЗапросаТекст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	WoW_СезонныеПодземелья.Подземелье.ОсновноеИзображение КАК ПутьККартинкеПодземелия,
		|	WoW_СезонныеПодземелья.Подземелье.Представление КАК НазваниеПодземелья,
		|	WoW_СезонныеПодземелья.Танк.Представление КАК ИмяТанка
		|ИЗ
		|	РегистрСведений.WoW_СезонныеПодземелья КАК WoW_СезонныеПодземелья
		|ГДЕ
		|	НЕ WoW_СезонныеПодземелья.Подземелье В(&БанСписок)
		|	И WoW_СезонныеПодземелья.Сезон = &Сезон";					
		
	ИначеЕсли РежимПодбора = "Подземелье для танка" Тогда
		ЗапросаТекст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	WoW_СезонныеПодземелья.Подземелье.ОсновноеИзображение КАК ПутьККартинкеПодземелия,
		|	WoW_СезонныеПодземелья.Подземелье.Представление КАК НазваниеПодземелья,
		|	WoW_СезонныеПодземелья.Танк.Представление КАК ИмяТанка
		|ИЗ
		|	РегистрСведений.WoW_СезонныеПодземелья КАК WoW_СезонныеПодземелья
		|ГДЕ
		|	НЕ WoW_СезонныеПодземелья.Подземелье В(&БанСписок)
		|	И WoW_СезонныеПодземелья.Танк = &Танк
		|	И WoW_СезонныеПодземелья.Сезон = &Сезон";
		
		Запрос.УстановитьПараметр("Танк", Танк);
		
	ИначеЕсли РежимПодбора = "Перемешать" Тогда
		ЗапросаТекст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	WoW_СезонныеПодземелья.Подземелье.ОсновноеИзображение КАК ПутьККартинкеПодземелия,
		|	WoW_СезонныеПодземелья.Подземелье.Представление КАК НазваниеПодземелья		
		|ИЗ
		|	РегистрСведений.WoW_СезонныеПодземелья КАК WoW_СезонныеПодземелья
		|ГДЕ
		|	НЕ WoW_СезонныеПодземелья.Подземелье В(&БанСписок)		
		|	И WoW_СезонныеПодземелья.Сезон = &Сезон";
		
	Иначе
		МодифицируемыеПараметры.Вставить("НазваниеПодземелья", "Не опознанный режим подбора.");
		Возврат Неопределено;
	КонецЕсли;			
	
	Запрос.Текст = ЗапросаТекст;
	
	Подземелия = Запрос.Выполнить().Выгрузить();
	
	КоличествоПодземелий = Подземелия.Количество();
	
	Если КоличествоПодземелий = 0 Тогда
		МодифицируемыеПараметры.Вставить("НазваниеПодземелья","По условиям ничего не нашлось.");
		Возврат Неопределено;
	КонецЕсли;
	
	Генератор = Новый ГенераторСлучайныхЧисел();
	ИскомыйИндекс = Генератор.СлучайноеЧисло(0, КоличествоПодземелий - 1);
	
	Если РежимПодбора = "Перемешать" Тогда
		МодифицируемыеПараметры.Вставить("НазваниеПодземелья",Подземелия[ИскомыйИндекс].НазваниеПодземелья);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	WoW_СезонныеПодземелья.Танк КАК ИмяТанка
		|ИЗ
		|	РегистрСведений.WoW_СезонныеПодземелья КАК WoW_СезонныеПодземелья
		|ГДЕ
		|	WoW_СезонныеПодземелья.Сезон = &Сезон";
		
		Танки = Запрос.Выполнить().Выгрузить();
		КоличествоТанков = Танки.Количество();
		
		ГенераторТанка = Новый ГенераторСлучайныхЧисел();
		ИскомыйИндексТанка = ГенераторТанка.СлучайноеЧисло(0, КоличествоТанков - 1);
		
		МодифицируемыеПараметры.Вставить("ИмяТанка",Танки[ИскомыйИндексТанка].ИмяТанка);		
	Иначе
		МодифицируемыеПараметры.Вставить("ИмяТанка",Подземелия[ИскомыйИндекс].ИмяТанка);
		МодифицируемыеПараметры.Вставить("НазваниеПодземелья",Подземелия[ИскомыйИндекс].НазваниеПодземелья);		
	КонецЕсли;		
				
	Возврат Подземелия[ИскомыйИндекс].ПутьККартинкеПодземелия;
КонецФункции

&НаКлиенте
Процедура ВывестиКартинкуВПолеФормы_ПровереноСуществованиеФайла(ФайлСуществует, ТранзитныеПараметры) ЭКСПОРТ
	
	ПутьКФайлу = ТранзитныеПараметры.ПутьКФайлу;
	
	Если НЕ ФайлСуществует Тогда
		ТекстПредупреждения = "По указанному пути отсутствует файл." + Символы.ПС;
		ТекстПредупреждения = ТекстПредупреждения + ПутьКФайлу + Символы.ПС;
		КиурКл.ОтобразитьПредупреждение(ТекстПредупреждения, ЭтаФорма);
		Возврат;
	КонецЕсли;
		
	ПутьКФайлу = СтрЗаменить(ПутьКФайлу, "\", "/");
	
	КартинкаПодземелия = КиурКлСрв.ПолучитьТекстHTML_ФайлаКартинки(ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура ПроигратьЗвук()

	ПолеАудио = "";
	ПолеАудио = "<!DOCTYPE html><html><head></head><body><audio controls=""controls"" autoplay autobuffer=""autobuffer"" autoplay=""autoplay"">
  	  |<source src=""data:audio/wav;base64," + ПолучитьДанныеЗвука() + """></audio></body></html>";
КонецПроцедуры 

Функция ПолучитьДанныеЗвука() Экспорт
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ДД = ОбработкаОбъект.ПолучитьМакет("Kosti");
	
	Возврат Base64Строка(ДД);
КонецФункции 

&НаКлиенте
Процедура СделатьПаузу(мСек)
	МоментСтарт = ТекущаяУниверсальнаяДатаВМиллисекундах();
	МоментФиниш = МоментСтарт + мСек;
	
	Пока Истина Цикл
		Если ТекущаяУниверсальнаяДатаВМиллисекундах() > МоментФиниш Тогда
			Прервать;
		КонецЕсли;
			
	КонецЦикла;	  
КонецПроцедуры		

#КонецОбласти

/////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
//////////////////////////////////Для удаления\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
/////////////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

#Область ДляУдаления

#КонецОбласти

////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\//////////////////////////////////////
////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\Для удаления/////////////////////////////
////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\//////////////////////////////////////
